STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Sink/Core/Src/app_entry.c
  /* Register Flash Manager task */
  UTIL_SEQ_RegTask(1U << CFG_TASK_FLASH_MANAGER, UTIL_SEQ_RFU, FM_BackgroundProcess);

  /* Disable flash before any use - RFTS */
  FD_SetStatus (FD_FLASHACCESS_RFTS, LL_FLASH_DISABLE);
  /* Enable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_ENABLE);
  /* Enable flash system flag */
  FD_SetStatus (FD_FLASHACCESS_SYSTEM, LL_FLASH_ENABLE);

  return;
}

/**
 * @brief Initialize Ble Public Key Accelerator module
 */
static void APPE_BPKA_Init(void)
{
  /* Register Ble Public Key Accelerator task */
  UTIL_SEQ_RegTask(1U << CFG_TASK_BPKA, UTIL_SEQ_RFU, BPKA_BG_Process);
}

static void APPE_AMM_Init(void)
{
  /* Initialize the Advance Memory Manager */
  if( AMM_Init(&ammInitConfig) != AMM_ERROR_OK )
  {
    Error_Handler();
  }

  /* Register Advance Memory Manager task */
  UTIL_SEQ_RegTask(1U << CFG_TASK_AMM, UTIL_SEQ_RFU, AMM_BackgroundProcess);
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
#if (CFG_JOYSTICK_SUPPORTED == 1)
/**
 * @brief  Action of Joystick NONE when Joystick state changes to None state, to be implemented by user.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickNoneAction( void )
{
#if (CFG_TEST_VALIDATION == 1u)
  LOG_INFO_APP("JOY_NONE\n");
  Joy_PreviousState = JOY_NONE;
#endif /*(CFG_TEST_VALIDATION == 1u)*/
}
/**
 * @brief  Action of Joystick UP when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickUpAction( void )
{
#if (CFG_TEST_VALIDATION == 1u)
  if (Joy_PreviousState == JOY_NONE)
  {
    LOG_INFO_APP("JOY 0x%02X\nOK\n",JOY_UP);
    Joy_PreviousState = JOY_UP;
#endif /*(CFG_TEST_VALIDATION == 1u)*/

    App_Menu_Up_Right();

#if (CFG_TEST_VALIDATION == 1u)
  }
#endif /*(CFG_TEST_VALIDATION == 1u)*/
}

/**
 * @brief  Action of Joystick RIGHT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickRightAction( void )
{
#if (CFG_TEST_VALIDATION == 1u)
  if (Joy_PreviousState == JOY_NONE)
  {
    LOG_INFO_APP("JOY 0x%02X\nOK\n",JOY_RIGHT);
    Joy_PreviousState = JOY_RIGHT;
#endif /*(CFG_TEST_VALIDATION == 1u)*/

    App_Menu_Up_Right();

#if (CFG_TEST_VALIDATION == 1u)
  }
#endif /*(CFG_TEST_VALIDATION == 1u)*/
}

/**
 * @brief  Action of Joystick DOWN when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickDownAction( void )
{
#if (CFG_TEST_VALIDATION == 1u)
  if (Joy_PreviousState == JOY_NONE)
  {
    LOG_INFO_APP("JOY 0x%02X\nOK\n",JOY_DOWN);
    Joy_PreviousState = JOY_DOWN;
#endif /*(CFG_TEST_VALIDATION == 1u)*/

    App_Menu_Down_Left();

#if (CFG_TEST_VALIDATION == 1u)
  }
#endif /*(CFG_TEST_VALIDATION == 1u)*/
}

/**
 * @brief  Action of Joystick LEFT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickLeftAction( void )
{
#if (CFG_TEST_VALIDATION == 1u)
  if (Joy_PreviousState == JOY_NONE)
  {
    LOG_INFO_APP("JOY 0x%02X\nOK\n",JOY_LEFT);
    Joy_PreviousState = JOY_LEFT;
#endif /*(CFG_TEST_VALIDATION == 1u)*/

    App_Menu_Down_Left();

#if (CFG_TEST_VALIDATION == 1u)
  }
#endif /*(CFG_TEST_VALIDATION == 1u)*/
}

/**
 * @brief  Action of Joystick SELECT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickSelectAction( void )
{
#if (CFG_TEST_VALIDATION == 1u)
  if (Joy_PreviousState == JOY_NONE)
  {
    LOG_INFO_APP("JOY 0x%02X\nOK\n",JOY_SEL);
    Joy_PreviousState = JOY_SEL;
#endif /*(CFG_TEST_VALIDATION == 1u)*/
#if (CFG_TEST_VALIDATION == 1u)
  }
#endif /*(CFG_TEST_VALIDATION == 1u)*/
}

#endif  /* CFG_JOYSTICK_SUPPORTED */

#if (CFG_LCD_SUPPORTED == 1)
static void LCD_Init( void )
{
  extern uint8_t wav_2[];
  char *pSourceName;

  BSP_SPI3_Init();

  /* Set LCD Foreground Layer  */
  UTIL_LCD_SetFuncDriver(&LCD_Driver); /* SetFunc before setting device */
  UTIL_LCD_SetDevice(0);               /* SetDevice after funcDriver is set */

  BSP_LCD_DisplayOn(0);

  BSP_LCD_Clear(0,SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* Set the LCD Text Color */
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetTextColor(SSD1315_COLOR_WHITE);
  UTIL_LCD_SetBackColor(SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  LCD_DrawBitmapArray(0 , 32, 128, 32, &wav_2[0]);

  mute = 1;
  DrawSpeakerState();

  UTIL_LCD_DisplayStringAt(0, 5, (uint8_t *)"AURACAST SINK", CENTER_MODE);

  pSourceName = PBPAPP_GetBrdSourceName();

  UTIL_LCD_DisplayStringAt(0, 5+12+2, (uint8_t *) pSourceName, CENTER_MODE);

  BSP_LCD_Refresh(0);

  /* release bus for power optimisation */
  BSP_SPI3_DeInit();
}

/* draw an array of bits at the specified offsets starting from corner top left. Ensure xlen is multiple of 8*/
static int32_t LCD_DrawBitmapArray(uint8_t xpos, uint8_t ypos, uint8_t xlen, uint8_t ylen, uint8_t *data){

  int32_t i,j,k;
  uint8_t mask;
  uint8_t* pdata = data;

  if (((xpos+xlen) > 128) || ((ypos+ylen) > 64))
  {
    /*out of screen*/
    return -1;
  }

  for (j=0 ; j < ylen ; j++)
  {
    for (i=0 ; i < xlen/8 ; i++)
    {
      mask = 0x80;
      for (k=0 ; k < 8 ; k++)
      {
        if ( mask & *pdata)
        {
          UTIL_LCD_SetPixel(i*8+k+xpos, j+ypos, SSD1315_COLOR_WHITE);
        }
        else
        {
          UTIL_LCD_SetPixel(i*8+k+xpos, j+ypos, SSD1315_COLOR_BLACK);
        }
        mask = mask >> 1;
      }
      pdata++;
    }
  }

  BSP_LCD_Refresh(0);

  return 0;
}

static void DrawSpeakerStateTask(void)
{
  BSP_SPI3_Init();
  DrawSpeakerState();
  BSP_SPI3_DeInit();
}

static void DrawSpeakerState(void)
{
  extern uint8_t volume_up[];
  extern uint8_t volume_mute[];
  uint8_t *pvolume;

  if (mute == 1)
  {
    /* Draw volume mute icon */
    pvolume = &volume_mute[0];
  }
  else
  {
    /* Draw volume up icon */
    pvolume = &volume_up[0];
  }

  LCD_DrawBitmapArray(108, 38, 16, 16, pvolume);
}
#endif  /* CFG_LCD_SUPPORTED */

/**
  * @brief Configure PLL for the audio frequency, PLL output is used for the SAI peripheral and as the core clock
  * @retval None
  */
void AudioClock_Init(uint32_t audio_frequency_type)
{
  uint32_t target_freq;
  if (audio_frequency_type == SAMPLE_FREQ_44100_HZ)
  {
    target_freq = 90316800;
  }
  else
  {
    /* valid for 8k, 16k, 24k, 32k or 48k */
    target_freq = 98304000;
  }

  if ( target_freq !=  PLL_Target_Clock_Freq )
  {
    scm_pll_config_t pll_config;
    LOG_INFO_APP("Audio Clock Initialization\n");

    pll_config.pll_mode = PLL_FRACTIONAL_MODE;
    pll_config.PLLM = 6;
    pll_config.PLLP = 4;
    pll_config.PLLQ = 4;
    pll_config.PLLR = 4;

    /* VCO frequency should be in range 128 to 544 MHz */
    /* PLL fractionnal should allows to cover +/-550ppm around the targeted frequency*/
    if (target_freq == 90316800)
    {
      pll_config.PLLN = 67;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (67 + 1) = 362.7 MHz */
      pll_config.PLLFractional = 6042;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_3;
      /* PLLSYS = 90.31673 MHz */
    }
    else
    {
      pll_config.PLLN = 73;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (73 + 1) = 394.7 MHz */
      pll_config.PLLFractional = 5964;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_4;
      /* PLLSYS = 98.30396 MHz */
    }

