STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Sink/Core/Src/app_entry.c
    UTIL_LPM_SetMaxMode(1 << CFG_LPM_AUDIO, UTIL_LPM_SLEEP_MODE);

    scm_pll_setconfig(&pll_config);

    scm_setsystemclock(SCM_USER_APP, SYS_PLL);

    /* enable P output used for the audio timer */
    LL_RCC_PLL1_EnableDomain_PLL1P();

    PLL_Target_Clock_Freq = target_freq;
  }
  else
  {
    LOG_INFO_APP("Audio Clock already configured\n");
  }
}

void PLL_Ready_ProcessIT(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_PLL_READY_ID, CFG_SEQ_PRIO_0);
}

void PLL_Ready_Task(void)
{
  /* set Link Layer audio timings */
  uint32_t iso_exec_time;
  Evnt_timing_t event_time;
  event_time.drift_time    = ISO_PLL_DRIFT_TIME;
  event_time.exec_time     = ISO_PLL_EXEC_TIME;
  event_time.schdling_time = ISO_PLL_SCHDL_TIME;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += ISO_PLL_DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += ISO_PLL_EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &iso_exec_time);

  CODEC_CLK_Init();

  AUDIO_PLLConfig_t corrector_pll_config;
  corrector_pll_config.PLLTargetFreq = PLL_Target_Clock_Freq;
  corrector_pll_config.VCOInputFreq = (32000000.0f / 6.0f); /* HSE / PLL_M */
  corrector_pll_config.PLLOutputDiv = 4; /* PLL_P */
  AUDIO_InitializeClockCorrector(&corrector_pll_config, 500, 4000);

  /* I2C init takes a long time, it is better to do it before CIS establishement */
  BSP_I2C_Init();
  BSP_I2C_CLK_DISABLE();
}

void PLL_Exit(void)
{
  if (PLL_Target_Clock_Freq != 0)
  {
    scm_setsystemclock(SCM_USER_APP, NO_CLOCK_CONFIG);

    PLL_Target_Clock_Freq = 0;

    UTIL_LPM_SetMaxMode(1 << CFG_LPM_AUDIO, UTIL_LPM_MAX_MODE);
  }
}

static void AudioClock_Deinit( void )
{
  /* back to default timings */
  Evnt_timing_t event_time;
  event_time.drift_time    = DRIFT_TIME_DEFAULT;
  event_time.exec_time     = EXEC_TIME_DEFAULT;
  event_time.schdling_time = SCHDL_TIME_DEFAULT;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &gDefault_Exec_Time);

  LOG_INFO_APP("Audio Clock Deinitialization\n");

  AUDIO_DeinitializeClockCorrector();
}

HAL_StatusTypeDef MX_SAI1_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t SampleRate)
{
  /* PLL already configured */

  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
  PeriphClkInit.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL1P;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_RCC_SAI1_CLK_ENABLE();

  return HAL_OK;
}

void MX_AudioInit(Audio_Role_t role,
                  Sampling_Freq_t sampling_frequency,
                  Frame_Duration_t frame_duration,
                  uint8_t *pSnkBuff,
                  uint8_t *pSrcBuff,
                  AudioDriverConfig driver_config)
{
  uint32_t sample_per_frame;
  uint32_t audioFrequency;
  BSP_AUDIO_Init_t audio_conf;

  switch (sampling_frequency)
  {
    case SAMPLE_FREQ_8000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_8K;
      break;

    case SAMPLE_FREQ_16000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_16K;
      break;

    case SAMPLE_FREQ_22050_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_22K;
      break;

    case SAMPLE_FREQ_24000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_24K;
      break;

    case SAMPLE_FREQ_32000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_32K;
      break;

    case SAMPLE_FREQ_44100_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_44K;
      break;

    case SAMPLE_FREQ_48000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_48K;
      break;

    default:
      Error_Handler();
      return;
  }

  if (sampling_frequency == SAMPLE_FREQ_44100_HZ)
  {
    /* LC3 need setup like 48Khz for this frequency */
    switch(frame_duration)
    {
      case FRAME_DURATION_7_5_MS:
        sample_per_frame = 360;
        break;

      case FRAME_DURATION_10_MS:
        sample_per_frame = 480;
        break;

      default:
        Error_Handler();
        return;
    }
  }
  else
  {
    switch(frame_duration)
    {
      case FRAME_DURATION_7_5_MS:
        sample_per_frame = audioFrequency * 75 / 10000;
        break;

      case FRAME_DURATION_10_MS:
        sample_per_frame = audioFrequency * 100 / 10000;
        break;

      default:
        Error_Handler();
        return;
    }
  }

  BSP_I2C_CLK_ENABLE();

  audio_conf.Device = AUDIO_OUT_DEVICE_HEADPHONE;
  audio_conf.ChannelsNbr = 2;
  audio_conf.Volume = 90;
  audio_conf.SampleRate = audioFrequency;
  audio_conf.BitsPerSample = AUDIO_RESOLUTION_16B;

  if (BSP_AUDIO_OUT_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
    /* Release Bus for power consumption optimisation */
    BSP_I2C_CLK_DISABLE();
    return;
  }

  /* Start SAI clock without DMA interrupt */
  uint8_t channel_at_src = 0;
  uint8_t channel_at_snk = 2;   /* SAI is in stereo for Headset */
  uint8_t buffer_nb = 2;        /* double buffer strategy for minimum latency*/
  uint8_t bytes_per_sample = 2;

  Sink_frame_size = sample_per_frame * channel_at_snk * buffer_nb;
  Source_frame_size = sample_per_frame * channel_at_src * buffer_nb;
  /* Start SAI clock without DMA interrupt */
  Init_AudioBuffer((uint8_t *)pSnkBuff,
                   Sink_frame_size * bytes_per_sample,
                   (uint8_t *)pSrcBuff,
                   Source_frame_size * bytes_per_sample);

  /* Release Bus for power consumption optimisation */
  BSP_I2C_CLK_DISABLE();
  MxAudioInit_Flag = 1;

}

void MX_AudioDeInit(void)
{
  if (MxAudioInit_Flag == 1)
  {
    MxAudioInit_Flag = 0;

    BSP_I2C_CLK_ENABLE();

    if (BSP_AUDIO_OUT_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    SET_BIT(haudio_out_sai.Instance->CR2, SAI_xCR2_FFLUSH);

    BSP_I2C_DeInit();
  }

  AudioClock_Deinit();

#if (CFG_LCD_SUPPORTED == 1)
  mute = 1;
  UTIL_SEQ_SetTask( 1U << CFG_TASK_DRAW_SPEAKER_ID, CFG_SEQ_PRIO_0);
#endif /* (CFG_LCD_SUPPORTED == 1) */
}

static void Init_AudioBuffer(uint8_t *pSnkBuff, uint16_t SnkBuffLen, uint8_t *pSrcBuff, uint16_t SrcBuffLen)
{
  UNUSED(SrcBuffLen);
  UNUSED(pSrcBuff);
  /* We start the SAI here but will pause the DMA on the first interrupt.
     The DMA will be relauched synchronized to the BLE transport for mastering audio latency */
  if ((SnkBuffLen  > 0) && (pSnkBuff != NULL))
  {
    if (BSP_AUDIO_OUT_Play(0, (uint8_t *)pSnkBuff, SnkBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Play_Req_Pause = 1;
  }
}

